posts/gson-polymorphic-deserialization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Gson Polymorphic Deserialization</title>
<!-- 2014-08-01 Fri 16:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bjarte Johansen" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Gson Polymorphic Deserialization</h1>
<p>
I am working on a project that requires deserialization of json text
and I am using <a href="https://code.google.com/p/google-gson/">Google gson</a> for it. The problem, however, is that I
am using subclassing to be able to perform different operation on
slightly different messages. I know the gson people are working on a
solution to the problem, but in the mean time I have come up with a
somewhat ugly hack that works for me.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="font-weight: bold;">package</span> ljos.<span style="font-weight: bold; text-decoration: underline;">adapter</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">lang</span>.<span style="font-weight: bold; text-decoration: underline;">reflect</span>.<span style="font-weight: bold; text-decoration: underline;">Type</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">ljos</span>.<span style="font-weight: bold; text-decoration: underline;">message</span>.<span style="font-weight: bold; text-decoration: underline;">Message</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">JsonDeserializationContext</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">JsonDeserializer</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">JsonElement</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">JsonObject</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">JsonParseException</span>;

<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MessageDeserializer</span> <span style="font-weight: bold;">implements</span> <span style="font-weight: bold; text-decoration: underline;">JsonDeserializer</span>&lt;Message&gt; {
    <span style="font-weight: bold; text-decoration: underline;">@Override</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">Message</span> <span style="font-weight: bold; font-style: italic;">deserialize</span>(<span style="font-weight: bold; text-decoration: underline;">JsonElement</span> <span style="font-weight: bold; font-style: italic;">json</span>, <span style="font-weight: bold; text-decoration: underline;">Type</span> <span style="font-weight: bold; font-style: italic;">typeOfT</span>,
            <span style="font-weight: bold; text-decoration: underline;">JsonDeserializationContext</span> <span style="font-weight: bold; font-style: italic;">context</span>) <span style="font-weight: bold;">throws</span> <span style="font-weight: bold; text-decoration: underline;">JsonParseException</span> {
        <span style="font-weight: bold; text-decoration: underline;">JsonObject</span> <span style="font-weight: bold; font-style: italic;">jobj</span> = json.getAsJsonObject();

        <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">type</span> = jobj.get(<span style="font-style: italic;">"type"</span>).getAsString().toLowerCase();
        <span style="font-weight: bold;">try</span> {
            Class&lt;?&gt; c = Class.forName(<span style="font-style: italic;">"ljos.message."</span>
                    + Character.toTitleCase(type.charAt(0))
                    + type.substring(1)
                    + <span style="font-style: italic;">"Message"</span>);
            <span style="font-weight: bold;">return</span> context.deserialize(json, c);
        } <span style="font-weight: bold;">catch</span> (<span style="font-weight: bold; text-decoration: underline;">ClassNotFoundException</span> <span style="font-weight: bold; font-style: italic;">e</span>) {
            <span style="font-weight: bold;">throw</span> <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">JsonParseException</span>(<span style="font-style: italic;">"Unrecognized action type: "</span> + type);
        }
    }
}
</pre>
</div>

<p>
As we can see here I dispatch on a keyword in the json called
type. I have a package that contains all the message types and use
<code>Class.forName()</code> to find the class. I then use the context, with
that class, to deserialize the message.
</p>

<p>
I have written some unit tests to ensure that it at least works in
the trivial case.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="font-weight: bold;">package</span> ljos.test.<span style="font-weight: bold; text-decoration: underline;">adapter</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">hamcrest</span>.CoreMatchers.<span style="font-weight: bold; text-decoration: underline;">hasItems</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">junit</span>.Assert.<span style="font-weight: bold; text-decoration: underline;">assertEquals</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">junit</span>.Assert.<span style="font-weight: bold; text-decoration: underline;">assertThat</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">junit</span>.Assert.<span style="font-weight: bold; text-decoration: underline;">assertTrue</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">junit</span>.<span style="font-weight: bold; text-decoration: underline;">Before</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">junit</span>.<span style="font-weight: bold; text-decoration: underline;">Test</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">junit</span>.<span style="font-weight: bold; text-decoration: underline;">runner</span>.<span style="font-weight: bold; text-decoration: underline;">RunWith</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">org</span>.<span style="font-weight: bold; text-decoration: underline;">junit</span>.<span style="font-weight: bold; text-decoration: underline;">runners</span>.<span style="font-weight: bold; text-decoration: underline;">JUnit4</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">ljos</span>.<span style="font-weight: bold; text-decoration: underline;">adapter</span>.<span style="font-weight: bold; text-decoration: underline;">MessageDeserializer</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">ljos</span>.<span style="font-weight: bold; text-decoration: underline;">message</span>.<span style="font-weight: bold; text-decoration: underline;">action</span>.<span style="font-weight: bold; text-decoration: underline;">Message</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">FieldNamingPolicy</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">Gson</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">GsonBuilder</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">com</span>.<span style="font-weight: bold; text-decoration: underline;">google</span>.<span style="font-weight: bold; text-decoration: underline;">gson</span>.<span style="font-weight: bold; text-decoration: underline;">JsonParseException</span>;

<span style="font-weight: bold; text-decoration: underline;">@RunWith</span>(JUnit4.<span style="font-weight: bold;">class</span>)
<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MessageDeserializerTest</span> {
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">Gson</span> <span style="font-weight: bold; font-style: italic;">gson</span>;

    <span style="font-weight: bold; text-decoration: underline;">@Before</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">initialize</span>() {
        gson = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">GsonBuilder</span>()
            .setFieldNamingPolicy(<span style="font-weight: bold; text-decoration: underline;">FieldNamingPolicy</span>.LOWER_CASE_WITH_DASHES)
            .registerTypeAdapter(Message.<span style="font-weight: bold;">class</span>, <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">MessageDeserializer</span>())
            .create();
    }

    <span style="font-weight: bold; text-decoration: underline;">@Test</span>
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">deserializesMoveMessage</span>() {
        <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">json</span> = <span style="font-style: italic;">"{'type':'move', 'direction':'left'}"</span>;
        <span style="font-weight: bold; text-decoration: underline;">Message</span> <span style="font-weight: bold; font-style: italic;">message</span> = gson.fromJson(json, Message.<span style="font-weight: bold;">class</span>);
        assertTrue(message <span style="font-weight: bold;">instanceof</span> MoveMessage);

        <span style="font-weight: bold; text-decoration: underline;">MoveAction</span> <span style="font-weight: bold; font-style: italic;">action</span> = (<span style="font-weight: bold; text-decoration: underline;">MoveMessage</span>)message;
        assertEquals(action.getType(), <span style="font-style: italic;">"move"</span>);
        assertEquals(action.getDirection(), <span style="font-style: italic;">"left"</span>);
    }

    <span style="font-weight: bold; text-decoration: underline;">@Test</span>(expected=JsonParseException.<span style="font-weight: bold;">class</span>)
    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">failsOnDeserializationOnNonsense</span>() {
        <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">json</span> = <span style="font-style: italic;">"{'message':'action', 'type':'nonsense'}"</span>;
        gson.fromJson(json, ActionMessage.<span style="font-weight: bold;">class</span>);
    }
}
</pre>
</div>

<p>
The <code>Message</code> and <code>MoveMessage</code> classes are defined as follows:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="font-weight: bold;">package</span> ljos.<span style="font-weight: bold; text-decoration: underline;">message</span>;

<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Message</span> {
    <span style="font-weight: bold;">protected</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">type</span>;

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">getMessage</span>() {
        <span style="font-weight: bold;">return</span> message;
    }
}
</pre>
</div>

<p>
and
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="font-weight: bold;">package</span> ljos.<span style="font-weight: bold; text-decoration: underline;">message</span>;

<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MoveMessage</span> <span style="font-weight: bold;">extends</span> <span style="font-weight: bold; text-decoration: underline;">Message</span> {
    <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold; font-style: italic;">direction</span>;

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">getDirection</span>() {
        <span style="font-weight: bold;">return</span> direction;
    }

}
</pre>
</div>
</div>
</body>
</html>
